{
  "komiks": [
    {
      "id": "1",
      "nama": "Naruto",
      "sinopsis": "Sebelum kelahiran Naruto, rubah setan besar telah menyerang Desa Konoha. Hokage ke-4 dari desa konoha menyegel iblis di dalam Naruto yang baru lahir, menyebabkan dia tumbuh dibenci oleh sesama penduduk desa. Meskipun kurangnya bakat di banyak bidang ninjutsu, Naruto berusaha untuk hanya satu tujuan: untuk mendapatkan gelar Hokage, ninja terkuat di desanya. Menginginkan rasa hormat yang tidak pernah dia terima, Naruto bekerja menuju mimpinya dengan teman-teman Sasuke dan Sakura dan gurunya Kakashi saat mereka melalui banyak cobaan dan pertempuran yang datang dengan menjadi seorang ninja.",
      "pictureId": "https://p4.wallpaperbetter.com/wallpaper/578/11/775/naruto-vs-sasuke-guys-quarrel-fight-wallpaper-preview.jpg",
      "pengarang": "Kishimoto, Masashi",
      "rating": 4.7,
      "genre": "action"
    },
    {
      "id": "2",
      "nama": "One Piece",
      "sinopsis": "One Piece diciptakan oleh Eiichiro Oda. Komiknya dimulai pada 1997 di Shonen Jump terbitan Shueisha dan hingga kini masih terus berlanjut. One piece itu sendiri bercerita tentang seorang Monkey D. Luffy, alias Luffy, seorang bajak laut yang berobsesi untuk menemukan One Piece, salah satu harta karun paling berharga yang ada di dunianya Luffy waktu itu. Setelah Luffy kecil diselamatkan oleh seorang bajak laut bernama Sanks, Luffy akhirnya bertekat untuk menjadi ‘the real’ bajak laut dengan cara berpetualang ke seluruh penjuru dunia dan menemukan One Piece. Di perjalanannya itulah Luffy menemukan berbagai petualangan seru bersama kapal Going Merry nya. Monkey D. Luffy alias Luffy, adalah kapten dari Kelompok Bajak Laut Topi Jerami. Kepala Luffy 300 juta berry setelah peristiwa di Enies Lobby. Ketika Luffy masih muda, dia secara tidak sengaja memakan Buah Iblis (di versi anime, dia memakannya asal-asalan dengan marah karena merajuk pada Shanks) yaitu Buah Gomu Gomu yang ia anggap adalah makanan penutup. Buah Gomu Gomu (Gomu berarti karet) adalah buah iblis yang menyebabkan tubuh pengguna menjadi melar kayak karet dan bisa memanjangkan anggota tubuhnya Berbeda dengan stereotype kebanyakan dari seorang Tokoh Utama, Luffy muncul malah dengan sifatnya yang sedikit bodoh dan ceroboh. Sebagai seorang bajak laut Luffy bisa dikatakan sangat awam karena tidak mengetahui apapun tentang kompas dan ilmu kelautan. Selain itu dia tidak bisa berenang karena memakan Buah Gomu Gomu. Ciri ciri dari Luffy adalah topi jerami di kepalanya, ia diberikan topi jerami oleh Shanks, bajak laut idolanya semasa ia masih kecil, sehingga kelak ia harus mengembalikannya jika bertemu lagi dilaut..",
      "pictureId": "https://p4.wallpaperbetter.com/wallpaper/965/883/624/manga-one-piece-wallpaper-preview.jpg",
      "pengarang": "Oda, Eiichiro",
      "rating": 4.3,
      "genre": "action"
    },
    {
      "id": "3",
      "nama": "Jujutsu No Kaisen",
      "sinopsis": "Yuuji adalah seorang jenius di jalur dan lapangan. Tapi dia memiliki minat nol, dia senang sebagai clam di Klub Penelitian Ilmu Ghaib. Meskipun Dia di Klub hanya untuk Iseng, Hal-hal menjadi serius ketika semangat nyata muncul di sekolah! Hidup akan menjadi sangat aneh Di SMA Negeri Sugisawa #3 !",
      "pictureId": "https://c4.wallpaperflare.com/wallpaper/158/122/422/anime-anime-boys-jujutsu-kaisen-yuji-itadori-sakuna-hd-wallpaper-preview.jpg",
      "pengarang": "Gege, Akutami",
      "rating": 4.4,
      "genre": "action"
    },
    {
      "id": "4",
      "nama": "Fairy Tail",
      "sinopsis": "Setelah mengatasi ancaman Acnologia dan Zeref, Fairy Tail sudah menjadi lebih kuat dan lebih energik! Quest 100 tahun yang ditinggalkan Natsu dan kawan-kawann, dan juga kepada para anggota tetap di guild, sesuatu yang baru akan terjadi!? Meskipun cerita ini seharusnya sudah selesai, petualangan baru sekarang dimulai!",
      "pictureId": "https://images4.alphacoders.com/167/thumb-1920-167128.jpg",
      "pengarang": "MASHIMA Hiro",
      "rating": 4.5,
      "genre": "adventure"
    },
    {
      "id": "5",
      "nama": "One Punch-man",
      "sinopsis": "One Punch-Man bercerita tentang peristiwa yang terjadi di kota metropolitan Jepang, sebuah kota fiksi bernama Z. Dunia ini penuh dengan monster aneh dan misterius yang muncul lalu menyebabkan bencana di kota. Saitama adalah pahlawan yang sangat kuat, dengan mudah ia mengalahkan monster atau penjahat hanya dengan satu pukulan. Namun, karena kekuatannya yang luar biasa, Saitama menjadi bosan dengan kehidupan pahlawannya dan terus berusaha mencari lawan yang lebih kuat yang mampu untuk melawannya. Pada petualangannya, ia bertemu teman-teman baru, musuh, serta seorang muridnya yang bernama Genos. Genos yang merupakan seorang cyborg bersama sang guru Saitama, bergabung dengan Asosiasi Para Pahlawan untuk mendapatkan ketenaran atas semua usahanya dalam menumpas kejahatan. Meskipun Saitama telah mengalahkan banyak monster kuat, ia tetap diremehkan oleh Asosiasi Para Pahlawan kelas atas. Kebanyakan orang termasuk pahlawan lain menuduh dia menjadi pahlawan palsu. Hanya sejumlah kecil orang mengakui bakat luar biasa dan kerendahan hati Saitama terhadap orang lain.",
      "pictureId": "https://wallpapermemory.com/uploads/656/one-punch-man-wallpaper-hd-1152x768-345194.jpg",
      "pengarang": "Murata, Yusuke",
      "rating": 4.7,
      "genre": "adventure"
    },
    {
      "id": "6",
      "nama": "Boruto",
      "sinopsis": "Boruto adalah putra Uzumaki Naruto, Hokage Ketujuh yang begitu dihormati karena jasanya dalam menyelamatkan dunia dan menjadi tokoh pahlawan legenda di generasi baru. Ini adalah kisah tentang Boruto dan teman-temannya sebagai ninja generasi baru yang diharapkan bisa melampaui generasi sebelumnya.",
      "pictureId": "https://i.pinimg.com/originals/10/36/60/1036602e365b0cf5b97cb1893a9265f9.jpg",
      "pengarang": "Ikemoto, Mikio",
      "rating": 4.7,
      "genre": "adventure"
    },
    {
      "id": "7",
      "nama": "Dragon Ball",
      "sinopsis": "Setelah Majin Boo dikalahkan, bumi kembali damai dan Goku bercocok tanam di sekitar kediamannya. Sanak keluarganya pun menikmati keadaan damai tersebut dengan melakukan aktivitas masing-masing. Seperti biasa, serial Dragon Ball bukanlah bertema drama melainkan anime aksi, jadinya akan ada ancaman baru yang mengarah ke bumi tempat mereka tinggal. Kali ini datang dari sosok yang bernama Beerus, God of Destruction. Beerus boleh dikatakan sosok menakutkan dan kuat di galaksi “Dragon Ball“. Dia berniat melawan ksatria legenda yang terlihat dalam sebuah ramalan yang dikenal sebagai Super Saiyan God.",
      "pictureId": "https://wallpaperaccess.com/full/334910.png",
      "pengarang": "TORIYAMA Akira, Toyotarou",
      "rating": 4.7,
      "genre": "comedy"
    },
    {
      "id": "8",
      "nama": "Tate no Yuusha no Nariagari",
      "sinopsis": "Iwatani Naofumi dipanggil ke dunia lain untuk menjadi salah satu dari 4 pahlawan, namun sayangnya dia terpilih menjadi pahlawan terlemah yaitu “Ksatria Perisai”. Dimulai dengan popularitas yang buruk dan dicap sebagai yang terlemah, Naofumi menemukan dirinya dikhianati pada hari ke-3 petualangannya. Kehilangan kepercayaan dan uang, yang tertinggal hanya perisai. Dia bersumpah untuk membalas dendam kepada mereka semua yang meninggalkannya.",
      "pictureId": "https://c4.wallpaperflare.com/wallpaper/722/28/973/anime-iwatani-naofumi-tate-no-yuusha-no-nariagari-hd-wallpaper-preview.jpg",
      "pengarang": "Aiya, Kyu",
      "rating": 4.9,
      "genre": "comedy"
    },
    {
      "id": "9",
      "nama": "Shuumatsu no Walküre",
      "sinopsis": "13 manusia terhebat dalam sejarah umat manusia akan melawan 13 dewa untuk menentukan nasib umat manusia apakah akan dimusnahkan atau tetap dibiarkan hidup dalam pertarungan ragnarok satu lawan satu antara manusia dengan dewa.",
      "pictureId": "https://w0.peakpx.com/wallpaper/691/520/HD-wallpaper-anime-record-of-ragnarok.jpg",
      "pengarang": "Fukui, Takumi",
      "rating": 4.7,
      "genre": "comedy"
    },
    {
      "id": "10",
      "nama": "Nanatsu no Taizai",
      "sinopsis": "“Tujuh Dosa Mematikan, ” sekelompok ksatria jahat yang bersekongkol untuk menggulingkan kerajaan Britannia, yang dikatakan telah diberantas oleh Ksatria Suci, meskipun beberapa mengklaim bahwa mereka masih hidup. Sepuluh tahun kemudian, Ksatria suci mengadakan kudeta dan membunuh raja, untuk membuat perang suci baru. Elizabeth, putri ketiga raja, menetapkan perjalanan untuk menemukan “Tujuh Dosa Mematikan, ” dan meminta bantuan mereka untuk mengambil kembali kerajaan",
      "pictureId": "https://w0.peakpx.com/wallpaper/521/1018/HD-wallpaper-nanatsu-no-taizai-2-meliodas-nanatsu-no-taizai-seven-deadly-sins-zeldris.jpg",
      "pengarang": "Suzuki, Nakaba",
      "rating": 4.7,
      "genre": "romance"
    },
    {
      "id": "11",
      "nama": "Boku no Hero Academia",
      "sinopsis": "Suatu hari, seorang bocah lelaki berusia empat tahun tiba-tiba menyadari: dunia tidak adil. Delapan puluh persen populasi dunia memiliki kemampuan khusus, yang dikenal sebagai “quirks,” yang telah memberikan banyak kekuatan untuk membuat impian masa kecil mereka menjadi pahlawan super menjadi kenyataan. Sayangnya, Izuku Midoriya adalah satu dari sedikit yang lahir tanpa kekhasan, menderita diskriminasi karenanya. Namun, ia menolak untuk menyerah pada mimpinya menjadi pahlawan; bertekad untuk melakukan hal yang mustahil, Izuku mengarahkan pandangannya pada akademi pelatihan pahlawan elit, UA High. Namun, semuanya berubah setelah pertemuan kebetulan dengan pahlawan nomor satu dan idola Izuku, All Might. Menemukan bahwa mimpinya bukanlah jalan buntu, bocah yang tidak berdaya menjalani pelatihan khusus, bekerja lebih keras dari sebelumnya. Akhirnya, ini menuntunnya mewarisi kekuatan All Might, dan dengan kemampuan barunya, masuk ke sekolah pilihannya, memulai perjalanannya yang melelahkan untuk menjadi penerus pahlawan terbaik di planet ini.",
      "pictureId": "https://wallpaperaccess.com/full/693531.jpg",
      "pengarang": "Horikoshi, Kouhei",
      "rating": 4.1,
      "genre": "romance"
    },
    {
      "id": "12",
      "nama": "Shokugeki no Souma",
      "sinopsis": "Mimpi Yukihira Soma adalah menjadi koki penuh waktu di restoran ayahnya dan melampaui keterampilan kuliner ayahnya. Tapi sama seperti Yukihira lulusan sekolah menengah ayahnya, Yukihira Jouichirou, menutup ke restoran untuk memasak di Eropa. Meskipun tertindas, semangat Soma bertarung dihidupkan kembali oleh tantangan dari Jouichirou yang bertahan di sebuah sekolah kuliner elit di mana hanya 10% dari lulusan siswa.",
      "pictureId": "https://i.pinimg.com/originals/6d/28/98/6d2898da3711330fc0f52bf3f3b4588c.jpg",
      "pengarang": "Saeki, Shun",
      "rating": 4.6,
      "genre": "romance"
    }
  ]
}
